[
  {
    "filename": "Private Transport for Tours & Trips Across Morocco 247.pdf",
    "raw_text": "\n--- Page 1 ---\nPrivate Transport for Tours & Trips Across Morocco 24/7\nMeeting & pickup\nWe pick up all travelers\nGeneral areas\nYou pick up from all locations within 1 general area\nTravelers cannot enter their own pickup location\nPickup starts: 15 minutes before departure\nAdditional pickup details\nPickup is available from anywhere in Casablanca—hotels, airport, train stations, or private\naddresses.\nWe provide private transport from Casablanca to all destinations in Morocco, including\nMarrakech, Rabat, Fes, Tangier, Meknes, Agadir, Chefchaouen, and more.\nJust share your exact pickup point, and your private driver will meet you on time.\nOur driver will contact you via WhatsApp or phone the day before the tour to confirm the\nexact pickup time and location.\nCategories & themes\nProduct types: Tour\nProduct itinerary types: Tour\nTour modes: 4WD, Car, Classic Car, Jeep, Luxury Car\nThemes: Airport Transfer, Virtual tour or activity\nTotal Duration: 12 hours\nWhat makes this tour unique?\nWhat truly sets us apart is our fair pricing, our full reliability, and our strong respect for time.\nWe are available 24/7 to assist you, ensuring comfort, trust, and a seamless travel experience\nwherever you go in Morocco.\nWe offer flexible pickup from any location in Casablanca and take you to the most popular\ncities in Morocco at competitive rates:\nRoute One Way ---------- Round Trip.\nCasablanca → Rabat 800 MAD 1,600 MAD\nCasablanca → Marrakech 1,600 MAD 2,500 MAD\nCasablanca → Fes 2,500 MAD 4,500 MAD\nCasablanca → Chefchaouen 2,700 MAD 5,200 MAD\nCasablanca → Tangier 2,300 MAD 4,400 MAD\n--- Page 2 ---\nCasablanca → Meknes 2,200 MAD 4,000 MAD\nCasablanca → Tetouan 2,500 MAD 4,900 MAD\nCasablanca → Merzouga (Sahara) 3,500 MAD 6,800 MAD\nFor any other city in Morocco, we can arrange the trip and agree on the price together once\nyou contact us. Your comfort and satisfaction are always our priority.\nInclusions & exclusions.\nWhat's included\nHotel pickup and drop-off (within Casablanca city center)\nPrivate air-conditioned vehicle\nProfessional and friendly driver (English or French speaking)\nBottled water during the tour\nParking fees and tolls\nDoor-to-door pickup and drop-off from Casablanca to any city in Morocco.\nFull support during the trip to make your travel safe, smooth, and...\nWhat's excluded\nPersonal expenses (shopping, etc.)\nGuides and languages\nIn-person: English, French\nAudio: None\nWritten: None\nIn-person guide is also the driver\nGuides are official\nInformation travelers need from you\nEdit\nReseller Status\nOfficial reseller\nAccessibility\n--- Page 3 ---\nWheelchair accessible\n(Including all transportation & surfaces)\nStroller accessible\nService animals allowed\nNear public transportation\nInfants must sit on laps\nInfant seats available\nHealth restrictions\nNot recommended for travelers with heart problems or other serious medical conditions\nLevel of difficulty\nMost travelers can participate\nYour phone number\nMA +212 623-956727",
    "title": "Private Transport for Tours & Trips Across Morocco 24/7",
    "description": "",
    "price": "800 MAD",
    "duration": ".",
    "included": [],
    "not_included": [],
    "highlights": [],
    "group_size": "",
    "itinerary": [],
    "meeting_point": "",
    "additional_info": []
  },
  {
    "filename": "Relaxing Hammam and Massage at Casablanca.pdf",
    "raw_text": "\n--- Page 1 ---\nRelaxing Hammam and Massage at Casablanca\nMeeting & pickup\nNo, we meet all travelers at a meeting point\nTravelers cannot enter their own pickup location\nMeeting point\nH2O Center - Spa & Hammam Casablanca, 31 Rue Abou El Hassan Es-Séghir, Casablanca\n28810, Morocco\nMeeting instructions\nPlease arrive at 31 Rue Abou El Hassan Es-Séghir, Casablanca 28810 at your scheduled time.\nShow your Viator confirmation at reception, and the staff will guide you to the spa. Arrive 10\nminutes early for a smooth check-in.\nActivities details\nActivity location\n31 Rue Abou El Hassan Es-Séghir, Casablanca 28810, Morocco\nActivity description\nStep out of your daily routine and come recharge in an environment designed for relaxation\nand well-being. Located in the heart of the Ghandi- district in Casablanca, H2O Center - Spa &\nHammam offers a variety of massages, luxurious private hammams, a hair and beauty salon\nusing top-quality products — all provided by attentive and professional staff. All these\nelements have been brought together to offer your body a special moment of relaxation,\nhelping you clear your mind and release all mental and muscular tension.\nStep away from the busy city life and treat yourself to a deeply relaxing and rejuvenating\nexperience in one of Casablanca’s most elegant wellness spaces — H2O Center - Spa &\nHammam .\nLocated in the vibrant Ghandi district, this hidden gem offers a luxurious private hammam, a\nwide variety of professional massages, and a modern beauty and hair salon using only the\nfinest products.\nLet yourself be pampered by our experienced and attentive team. Whether you're visiting\nCasablanca for the first time or a returning traveler, this is your chance to experience\nauthentic Moroccan wellness with a modern touch.\nShow less\nDuration: 1 hour\n--- Page 2 ---\nThis spa experience takes place at H2O Center – Spa & Hammam Casablanca, located in the\nheart of Casablanca, offering a blend of modern comfort and authentic Moroccan rituals.\nUnlike standard spas, here you will enjoy a private, calm environment guided by professional\nstaff who speak English and provide personalized service.\nThe traditional Moroccan hammam and massage are performed using natural, locally sourced\nproducts such as black soap and argan oil.\nIt’s not just a treatment – it’s a cultural immersion into Moroccan wellness traditions. Perfect\nfor travelers looking to relax and discover local heritage at the same time.\nInclusions & exclusions\nWhat's included\nReception assistance in English and will guide you and help with all\nTraditional Moroccan Hammam treatment\nFull-body relaxing massage\nPrivate access to the spa facilities\nWhat's excluded\nHotel pickup and drop-off\nPersonal expenses or additional spa treatments not listed\nGuides and languages\nEdit\nLanguages offered: English, German, French\nGuides are independent\nInformation travelers need from you\nReseller Status\nOfficial reseller\nAccessibility\nWheelchair accessible\n(Including all transportation & surfaces)\nStroller accessible\n--- Page 3 ---\nNear public transportation\nInfants must sit on laps\nInfant seats available\nHealth restrictions\nNot recommended for travelers with heart problems or other serious medical conditions\nLevel of difficulty\no fi had experence kaynin la lasit li fiha\nOriental Hammam 1 hour\n$100.00\n1 Traveler x $100.00\nCandle Massage-1 hour\n$110.00\n1 Traveler x $110.00\nTonic Massage-1 hour\n$110.00\n1 Traveler x $110.00\nTraditional Hammam - 1 hour\n$110.00\n1 Traveler x $110.00\n--- Page 4 ---\nRelaxing Hammam and Massage at a Boutique Hotel Spa Casablanca\n$110.00\n1 Traveler x $110.00\nCalifornian Massage - 1 hour\n$130.00\n1 Traveler x $130.00\nHot Stone Massage - 1 hour\n$150.00\n1 Traveler x $150.00\nVIP Hammam – 1.5 Hours\n$200.00\n1 Traveler x $200.00\nRoyal Hammam – 1.5 Hours\n$250.00\n1 Traveler x $250.00",
    "title": "Relaxing Hammam and Massage at Casablanca",
    "description": "",
    "price": "$100.00",
    "duration": ".",
    "included": [],
    "not_included": [],
    "highlights": [],
    "group_size": "",
    "itinerary": [],
    "meeting_point": "",
    "additional_info": []
  },
  {
    "filename": "Dinner and DJ Night on The James Rooftop An Elevated Casablanca .pdf",
    "raw_text": "\n--- Page 1 ---\nDinner and DJ Night on The James Rooftop An\nElevated Casablanca\nMeeting & pickup\nEdit\nNo, we meet all travelers at a meeting point\nTravelers cannot enter their own pickup location\nMeeting point\nJM Suites Hotel, 161 Angle Bd Rachidi, Casablanca 20070, Morocco\nMeeting instructions\nPlease go to the reception desk at The Jemes Suites Hotel and show\nyour Viator booking confirmation.\nThe staff will guide you to the rooftop . Arrive 10–15 minutes early.\nCategories & themes\nProduct types: Activity\nProduct itinerary types: Activity\nActivities: Dinner\nThemes: Food & Drink, Gourmet Food, Dessert\nActivities details\nActivity location\n161 Angle Bd Rachidi, Casablanca 20070, Morocco\nActivity description\nUpon arrival at JM Suites Hotel, simply check in at the hotel reception.\nShow your Viator reservation (either printed or on your phone), and the\nteam will guide you to the elevator that takes you directly to T...Show all\n--- Page 2 ---\nSample Menu\n1. The Jame’s rooftop signature salad, A fresh and vibrant mix of seasonal greens, crunchy\nvegetables, and our special house dressing – light and flavorful to start your evening.\n2. Pasta Bolognese, A hearty Italian classic prepared with rich meat sauce and perfectly\ncooked pasta – a warm and satisfying main dish.\n3. The Jame’s Tiramisu, Our homemade signature tiramisu – creamy, airy, and deliciously\nsweet, offering the perfect end to your meal.\n4. Dream Cocktail (Non-Alcoholic), A refreshing mocktail crafted with fresh strawberries,\nbasil, brown sugar, apple juice, and a splash of 7Up\nDuration: 5 hours\nAttraction: Casablanca\nWhat makes this activity unique?\nWhat sets this rooftop experience apart is its unique blend of gourmet food, vibrant\nambiance, and live entertainment in one of Casablanca’s most scenic locations. Guests enjoy\na 3-course dinner with a welcome non-alcoholic Dream Cocktail, while taking in panoramic\ncity views. A wide selection of alcoholic drinks and beers is also available. From Thursday to\nSaturday, a professional DJ performs live, mixing Spanish, Western, and international music\nto create an energetic and unforgettable vibe. On Sunday to Wednesday, enjoy a more relaxed\nrooftop atmosphere with curated background music. With outstanding service, a friendly\nteam, and one of the best views in Casablanca, this is more than just dinner — it’s an\nexperience.\nGroup type: Not private (shared)\nMax travelers per product: 30\nInclusions & exclusions\nWhat's included\nThe Jame’s rooftop signature salad.\n2. Pasta Bolognese\n--- Page 3 ---\n3. The Jame’s Tiramisu\n4. Dream Cocktail (Non-Alcoholic)\nWhat's excluded\nPrivate transportation\nPersonal expenses or additional spa treatments not listed\n$\npriceee its ----180",
    "title": "Dinner and DJ Night on The James Rooftop An",
    "description": "",
    "price": "",
    "duration": "5 hours",
    "included": [],
    "not_included": [],
    "highlights": [],
    "group_size": "travelers per product: 30",
    "itinerary": [],
    "meeting_point": "",
    "additional_info": []
  },
  {
    "filename": "⭐ 8-Day Morocco Discovery Tour Casablanca • Rabat • Fes • Marrakech • Sahara Desert • Casablanca Airport. +2.pdf",
    "raw_text": "\n--- Page 1 ---\n* 8-Day Morocco Discovery Tour: Casablanca • Rabat • Fes • Marrakech • Sahara\nDesert .\nOverview.\nExperience Morocco’s imperial cities and the majestic Sahara Desert on this unforgettable 8-day private\ntour.Explore historic medinas, iconic mosques, ancient kasbahs, Atlas mountain passes, lush valleys, and the\ngolden dunes of Merzouga. Stay in beautiful hotels and traditional riads, enjoy Berber hospitality, and travel\ncomfortably with a private driver.\nHighlights (Bullet Points):\n✔\nPrivate airport/hotel pick-up & drop-off.\n✔\nExplore Casablanca: Hassan II Mosque, Old Medina, Corniche.\n✔\nDiscover Rabat: Kasbah des Oudayas, Medina, historic gates.\n✔\nWander Fes’ ancient streets, Chouara Tannery & Al Quaraouiyine.\n✔\nStay in top-quality hotels & traditional riads (breakfast included).\n✔\nVisit Marrakech: Koutoubia Mosque, Ben Youssef Medersa, Bahia Palace & Souks.\n✔\n3-day Sahara Desert adventure: camel ride, luxury desert camp, Berber music.\n✔\nScenic drives through Atlas Mountains, Valley of Roses & Todra Gorges.\n✔\nPrivate, air-conditioned land transport throughout.\nFull Itinerary (Optional, Detailed Description on Viator):\n★\nDay 1: Casablanca city tour (Hassan II Mosque, Medina, Corniche) – Overnight 4 hotel\nDay 2: Casablanca → Rabat (Medina, Kasbah des Oudayas, Remparts) – drive to Fes\nDay 3: Fes city tour (Fes El Bali, Chouara Tannery, Al Quaraouiyine) – Overnight hotel\nDay 4: Fes → Sahara Desert via Middle Atlas & Ziz Valley – Sunset camel ride, overnight\nluxury desert camp\nDay 5: Merzouga → Todra Gorges → Dades Valley – Overnight traditional hotel\nDay 6: Dades → Valley of Roses → Ait Ben Haddou → Marrakech via Tichka Pass –\nOvernight riad\nDay 7: Marrakech city tour (Koutoubia, Ben Youssef Medersa, Bahia Palace, Souks) –\nFree evening at Jemaa El-Fnaa – Overnight riad\nDay 8: Marrakech → Casablanca Airport – End of tour\nDay 1 — Casablanca Arrival & City Tour.\n✔ Pick-up from airport or hotel.\n✔ Visit Hassan II Mosque (exterior & interior if tickets available).\nCompleted in 1993, it is one of the largest mosques in the world, built partly over the Atlantic Ocean.\nFamous for its 210-meter minaret and stunning Moroccan-Andalusian architecture.\n✔ Explore the Old Medina of Casablanca.\n--- Page 2 ---\nBuilt in the 19th century, it is the oldest part of Casablanca, known for its narrow alleys and traditional Moroccan markets.\n✔ Walk along Casablanca Corniche (Ain Diab).\nDeveloped mainly in the 20th century, this coastal promenade is a modern leisure hub along the Atlantic Ocean.\nKnown for its beaches, cafés, nightclubs, and luxury seaside resorts.\n✔ Overnight in a 4★ hotel in Casablanca (breakfast included).\nDay 2 — Casablanca → Rabat (City Tour).\n✔ Transfer to the capital Rabat\n✔ Visit:\nLa Médina (Old Town).\nDating back to the 17th century (1600s), the Medina of Rabat was rebuilt during the Alaouite dynasty after destruction by\nthe Moriscos. It is known for its blue-white Andalusian style, traditional souks, and historic fortified gates.\nKasbah des Oudayas (blue & white fortress).\nBuilt in the 12th century, this historic fortress overlooks the Bouregreg River and the Atlantic Ocean.\nFamous for its blue-and-white houses, narrow streets, and beautiful Andalusian gardens.\nRemparts & historic gates.\nConstructed between the 12th and 17th centuries, Rabat’s city walls and gates protected the city from invasions.\nVisitors can admire the fortified walls, monumental gates,\nFrom Rabat, we will drive directly to Fes, and Day 3 of the program will officially begin in Fes.\nDay 3 → Fes (Imperial City Discovery)\n✔\nScenic drive to Fes\n✔\nVisit inside Fes Medina:\nFesEl Bali.\nFounded in the 9th century (789 AD), it is the oldest walled part of Fes and a UNESCO World Heritage site.\nFamous for its narrow streets, traditional souks, and historic landmarks, offering an authentic Moroccan experience.\nChouara Tannery .\nEstablished in the 11th century, it is one of the oldest leather tanneries in the world.\nRenowned for its colorful dye pits and traditional leather-making techniques still in use today.\nAl Quaraouiyine Mosque & University (outside).\n--- Page 3 ---\nFounded in 859 AD, it is considered the world’s oldest continuously operating university.\nFamous for its historic architecture and its role as a center of Islamic learning.\n✔\nOvernight in a beautiful hotel in Fes (breakfast included).\nDay 4 — Fes → Sahara Desert (Start of 3-Day Tour)\nFes →Ifrane → Ziz Valley → Erfoud → Merzouga → Desert Camp\n✔\nPick-up from your hotel in Fes\n✔\nDrive through the Middle Atlas Mountains\nFormed millions of years ago, the Middle Atlas stretch across central Morocco and are known for their cedar\nforests and Berber villages.\nFamous for scenic winding roads, fresh mountain air, and panoramic landscapes.\n✔ Enjoy panoramic views of Ziz Valley.\nDating back to ancient caravan routes, the Ziz Valley has long been a lifeline for travelers crossing the desert.\nFamous for its dramatic palm oasis, deep canyons, and breathtaking contrast between green valleys and\ndesert mountains.\n✔ Arrive in Erfoud (Gateway to the Sahara)✔ Continue to Merzouga.\nFounded in the early 20th century, Erfoud is known as the “Gateway to the Sahara” due to its strategic location\nbefore the dunes.\nFamous for its fossil workshops, desert landscapes, and as the last major town before entering Merzouga.\n✔\nContinue to Merzouga\nA small desert village established near the Erg Chebbi dunes, one of Morocco’s highest sand dune fields.\nRenowned for its golden dunes, camel trekking, and breathtaking Sahara sunsets.\n✔ Start your sunset camel trekking into the Erg Chebbi dunes.\nBegin your camel ride across the golden sands as the sun sets, painting the dunes in magical colors.\nThis peaceful journey takes you deep into the Sahara, offering one of Morocco’s most iconic experiences.\n✔\nEnjoy sandboarding & Berber drumming under the stars\n🏜\nOvernight in a luxury Sahara desert camp (dinner & breakfast included)\nDay 5 — Merzouga → Todra Gorges → Dades Valley\n✔\nSunrise over the Sahara\n✔\n4WD transfer back to the driver\n✔\nDrive to Todra Gorges\n--- Page 4 ---\nMassive cliffs reaching 300m\nPerfect for walking along the river\n✔ Continue to Dades Valley\n✔ Explore the beautiful rock formations (“Monkey Fingers”)\n🏨 Overnight in a traditional hotel in Dades (dinner & breakfast included)\nDay6 — Dades → Valley of Roses → Ait Ben Haddou → Marrakech\n✔ Drive through the Valley of Roses✔ Explore Ait Ben Haddou (UNESCO World Heritage Site).\nEnjoy a scenic drive through fragrant rose fields and Berber villages before visiting the famous Ait Ben Haddou, a historic\nearthen ksar and UNESCO World Heritage site featured in many international films.\n✔ Cross the High Atlas Mountains via Tichka Pass (2260 m).\nDrive across one of Morocco’s highest and most scenic mountain passes, offering dramatic landscapes, winding roads, and\nbreathtaking views over the High Atlas peaks.\n✔\nArrive in Marrakech .\n🏨 Overnight in a traditional Moroccan riad (breakfast included)\nDay 7 — Marrakech City Tour\n✔ Visit the main highlights of Marrakech:\n✔ Koutoubia Mosque.\nBuiltin the 12th century, it is Marrakech’s largest and most iconic mosque, famous for its 77-meter minaret and elegant\nAlmohad architecture. It serves as a landmark visible from across the city and a symbol of Marrakech’s rich Islamic\nheritage.\n✔ Ben Youssef Medersa.\nFounded in the 14th century and rebuilt in the 16th century, this former Islamic school is renowned for its stunning\nMoroccan architecture, intricate zellige tiles, and peaceful courtyard. It was once one of the largest theological colleges in\nNorth Africa.\n✔ Bahia Palace.\nBuilt in the 19th century, this grand palace showcases exquisite Moroccan architecture, with beautiful gardens, ornate\ncourtyards, and intricate tilework, reflecting the wealth and artistry of the era.\n✔ Souk Semmarine & the Medina.\nExplore Marrakech’s bustling market streets, full of vibrant shops, traditional crafts, spices, textiles, and the lively\natmosphere of the historic medina.\n--- Page 5 ---\nFree evening to enjoy Jemaa El-Fnaa square\nOvernight in your riad in Marrakech (breakfast included)\nDay 8 — Marrakech → Casablanca Airport\n✔ Private transfer from your riad in Marrakech to Casablanca Mohammed V Airport\n✔ Enjoy the beautiful changing landscapes along the drive.\nEnd of the tour .",
    "title": "* 8-Day Morocco Discovery Tour: Casablanca • Rabat • Fes • Marrakech • Sahara",
    "description": "",
    "price": "",
    "duration": "8-Day",
    "included": [],
    "not_included": [],
    "highlights": [],
    "group_size": "",
    "itinerary": [],
    "meeting_point": "",
    "additional_info": []
  }
]